# -*- coding: utf-8 -*-
# Copyright: (c) 2016, Chamchenko
# GNU General Public License v2.0+ (see LICENSE.txt or https://www.gnu.org/licenses/gpl-2.0.txt)
# This file is part of plugin.video.shahid

from __future__ import unicode_literals


GENRES_TVSHOWS = [
                        {'id': '', 'title': 'الكل'},
                        {'id': 7876, 'title': 'دراما'},
                        {'id': 10077, 'title': 'قريباً'},
                        {'id': 7858, 'title': 'كوميديا'},
                        {'id': 9651, 'title': 'غموض'},
                        {'id': 8153, 'title': 'بوليوود'},
                        {'id': 7871, 'title': 'رومانسي'},
                        {'id': 10354, 'title': 'رمضان 2021'},
                        {'id': 9649, 'title': 'رسوم متحركة'},
                        {'id': 7860, 'title': 'رياضة'},
                        {'id': 10125, 'title': 'أنيمي'},
                        {'id': 9823, 'title': 'خيال'},
                        {'id': 7935, 'title': 'أكشن'},
                        {'id': 9830, 'title': 'عائلي'},
                        {'id': 9654, 'title': 'مغامرة'},
                        {'id': 7939, 'title': 'جريمة'},
                        {'id': 9829, 'title': 'تعليمي'},
                        {'id': 7870, 'title': 'موسيقي'},
                        {'id': 7873, 'title': 'تاريخي'},
                        {'id': 9655, 'title': 'سيرة ذاتية'},
                        {'id': 7936, 'title': 'إثارة وتشويق'},
                        {'id': 7882, 'title': 'وثائقي'},
                        {'id': 7863, 'title': 'اجتماعي'},
                        {'id': 9859, 'title': 'أطفال'},
                        {'id': 7877, 'title': 'كارتون'},
                        {'id': 10133, 'title': 'إثارة'},
                        {'id': 9652, 'title': 'خيال علمي'},
                        {'id': 7864, 'title': 'تلفزيون الواقع'},
                        {'id': 10091, 'title': 'مترجم'},
                        {'id': 7872, 'title': 'رعب'},
                        {'id': 7868, 'title': 'سياسي'},
                        {'id': 9799, 'title': 'واقعي'},
                        {'id': 7938, 'title': 'مسرحية'},
                        {'id': 9828, 'title': 'ترفيهي'},
                        {'id': 10092, 'title': 'مدبلج'},
                        {'id': 8150, 'title': 'مقابلات'},
                        {'id': 9807, 'title': 'حواري'},
                        {'id': 7876, 'title': 'Drama'},
                        {'id': 9801, 'title': 'تحقيقات'},
                        {'id': 9656, 'title': 'نفسي'},
                        {'id': 9803, 'title': 'تكنولوجيا'},
                        {'id': 9657, 'title': 'تشويق'},
                        {'id': 7869, 'title': 'ديني'},
                        {'id': 9826, 'title': 'ما قبل المدرسة'},
                        {'id': 7867, 'title': 'لايف ستايل'},
                        {'id': 9796, 'title': 'طبخ'},
                        {'id': 9822, 'title': 'أبطال'},
                        {'id': 9650, 'title': 'طبيعة'},
                        {'id': 9949, 'title': 'حفلات'},
                        {'id': 7866, 'title': 'سياحة'},
                        {'id': 9706, 'title': 'بيئة شامية'},
                        {'id': 7883, 'title': 'برنامج'},
                        {'id': 10105, 'title': 'أصدقاء'}
                    ]


GENRES_PROGRAMS = [
                        {'id': '', 'title': 'الكل'},
                        {'id': 7860, 'title': 'رياضة'},
                        {'id': 7870, 'title': 'موسيقي'},
                        {'id': 9828, 'title': 'ترفيهي'},
                        {'id': 10354, 'title': 'رمضان 2021'},
                        {'id': 7874, 'title': 'مسابقات'},
                        {'id': 9796, 'title': 'طبخ'},
                        {'id': 9830, 'title': 'عائلي'},
                        {'id': 7863, 'title': 'اجتماعي'},
                        {'id': 7883, 'title': 'برنامج'},
                        {'id': 9655, 'title': 'سيرة ذاتية'},
                        {'id': 7867, 'title': 'لايف ستايل'},
                        {'id': 7858, 'title': 'كوميديا'},
                        {'id': 7864, 'title': 'تلفزيون الواقع'},
                        {'id': 7882, 'title': 'وثائقي'},
                        {'id': 7873, 'title': 'تاريخي'},
                        {'id': 7869, 'title': 'ديني'},
                        {'id': 9949, 'title': 'حفلات'},
                        {'id': 8150, 'title': 'مقابلات'},
                        {'id': 9859, 'title': 'أطفال'},
                        {'id': 9807, 'title': 'حواري'},
                        {'id': 7861, 'title': 'إخباري'},
                        {'id': 7859, 'title': 'ثقافي'},
                        {'id': 7868, 'title': 'سياسي'},
                        {'id': 9800, 'title': 'سفر'},
                        {'id': 7862, 'title': 'توك شو'},
                        {'id': 7865, 'title': 'صحة'},
                        {'id': 7857, 'title': 'مصارعة'},
                        {'id': 9804, 'title': 'علوم'},
                        {'id': 9668, 'title': 'هوليوود'},
                        {'id': 10194, 'title': 'طبي'},
                        {'id': 10174, 'title': 'المطبخ الشرقي'},
                        {'id': 10177, 'title': 'حلويات'},
                        {'id': 10176, 'title': 'وصفات طعام'},
                        {'id': 10178, 'title': 'ماكولات'},
                        {'id': 10091, 'title': 'مترجم'},
                        {'id': 7876, 'title': 'دراما'},
                        {'id': 9650, 'title': 'طبيعة'},
                        {'id': 9803, 'title': 'تكنولوجيا'},
                        {'id': 7936, 'title': 'إثارة وتشويق'},
                        {'id': 7938, 'title': 'مسرحية'},
                        {'id': 9799, 'title': 'واقعي'},
                        {'id': 9809, 'title': 'ترفيه واقعي'},
                        {'id': 9654, 'title': 'مغامرة'},
                        {'id': 9829, 'title': 'تعليمي'},
                        {'id': 9649, 'title': 'رسوم متحركة'},
                        {'id': 8153, 'title': 'بوليوود'},
                        {'id': 9657, 'title': 'تشويق'},
                        {'id': 10133, 'title': 'إثارة'},
                        {'id': 7877, 'title': 'كارتون'},
                        {'id': 7866, 'title': 'سياحة'},
                        {'id': 7935, 'title': 'أكشن'},
                        {'id': 9823, 'title': 'خيال'}
                    ]


DIALECTS_TVSHOWS = [
                        {'id': '', 'title': 'الكل'},
                        {'id': 7911, 'title': 'خليجي'},
                        {'id': 7908, 'title': 'عربي'},
                        {'id': 7929, 'title': 'باكستاني مدبلج'},
                        {'id': 8147, 'title': 'سعودي'},
                        {'id': 7919, 'title': 'كوري مدبلج'},
                        {'id': 9819, 'title': 'الأجنبية'},
                        {'id': 7921, 'title': 'الإنجليزية'},
                        {'id': 9941, 'title': 'أطفال مدبلج'},
                        {'id': 7915, 'title': 'مصري'},
                        {'id': 7918, 'title': 'سوري'},
                        {'id': 7916, 'title': 'لبناني'},
                        {'id': 9858, 'title': 'أطفال عربي'},
                        {'id': 9798, 'title': 'الفرنسية'},
                        {'id': 8180, 'title': 'كوري'},
                        {'id': 9931, 'title': 'أطفال انجليزي'},
                        {'id': 7912, 'title': 'هندي مدبلج'},
                        {'id': 7920, 'title': 'لاتيني مدبلج'},
                        {'id': 7917, 'title': 'أردني'},
                        {'id': 10100, 'title': 'أجنبي مدبلج'},
                        {'id': 7914, 'title': 'تركي مدبلج'},
                        {'id': 8149, 'title': 'مغربي'},
                        {'id': 8151, 'title': 'هندي'},
                        {'id': 7909, 'title': 'عراقي'},
                        {'id': 9783, 'title': 'لاتيني مترجم'}
                    ]


DIALECTS_PROGRAMS = [
                        {'id': '', 'title': 'الكل'},
                        {'id': 7921, 'title': 'الإنجليزية'},
                        {'id': 7908, 'title': 'عربي'},
                        {'id': 7915, 'title': 'مصري'},
                        {'id': 8149, 'title': 'مغربي'},
                        {'id': 8147, 'title': 'سعودي'},
                        {'id': 9858, 'title': 'أطفال عربي'},
                        {'id': 7909, 'title': 'عراقي'},
                        {'id': 7911, 'title': 'خليجي'},
                        {'id': 7916, 'title': 'لبناني'},
                        {'id': 7914, 'title': 'تركي مدبلج'},
                        {'id': 8151, 'title': 'هندي'}
                    ]


GENRES_TVSHOWS_KIDS = [
                        {'id': 9649, 'title': 'رسوم متحركة'},
                        {'id': 10125, 'title': 'أنيمي'},
                        {'id': 9829, 'title': 'تعليمي'},
                        {'id': 9859, 'title': 'أطفال'},
                        {'id': 7877, 'title': 'كارتون'},
                        {'id': 9826, 'title': 'ما قبل المدرسة'}
                    ]


GENRES_PROGRAMS_KIDS = [
                            {'id': 9859, 'title': 'أطفال'},
                            {'id': 9649, 'title': 'رسوم متحركة'},
                            {'id': 7877, 'title': 'كارتون'}
                       ]


DIALECTS_TVSHOWS_KIDS = [
                            {'id': 9941, 'title': 'أطفال مدبلج'},
                            {'id': 9858, 'title': 'أطفال عربي'},
                            {'id': 9931, 'title': 'أطفال انجليزي'}
                        ] 

DIALECTS_PROGRAMS_KIDS = [
                            {'id': 9858, 'title': 'أطفال عربي'}
                         ]



GENRES_MOVIES = [
                    {'id': '', 'title': 'الكل'},
                    {'title': 'قريباً', 'id': 10077},
                    {'title': 'كوميديا', 'id': 7858},
                    {'title': 'دراما', 'id': 7876},
                    {'title': 'غموض', 'id': 9651},
                    {'title': 'مسرحية', 'id': 7938},
                    {'title': 'ترفيهي', 'id': 9828},
                    {'title': 'عائلي', 'id': 9830},
                    {'title': 'رمضان 2021', 'id': 10354},
                    {'title': 'رسوم متحركة', 'id': 9649},
                    {'title': 'أكشن', 'id': 7935},
                    {'title': 'مغامرة', 'id': 9654},
                    {'title': 'خيال علمي', 'id': 9652},
                    {'title': 'إثارة وتشويق', 'id': 7936},
                    {'title': 'رعب', 'id': 7872},
                    {'title': 'وثائقي', 'id': 7882},
                    {'title': 'طبي', 'id': 10194},
                    {'title': 'تاريخي', 'id': 7873},
                    {'title': 'سيرة ذاتية', 'id': 9655},
                    {'title': 'رياضة', 'id': 7860},
                    {'title': 'رومانسي', 'id': 7871},
                    {'title': 'إثارة', 'id': 10133},
                    {'title': 'جريمة', 'id': 7939}
                  ]


DIALECTS_MOVIES = [
                    {'id': '', 'title': 'الكل'},
                    {'title': 'مصري', 'id': 7915},
                    {'title': 'لبناني', 'id': 7916},
                    {'title': 'خليجي', 'id': 7911},
                    {'title': 'عربي', 'id': 7908},
                    {'title': 'الإنجليزية', 'id': 7921},
                    {'title': 'سعودي', 'id': 8147}
                  ]
GENRES_MOVIES_KIDS = [
                        {'title': 'رسوم متحركة', 'id': 9649}
                     ]
