Repository: chamchenko/plugin.video.shahid
Catalog: resources/language/resource.language.*/strings.po
Languages: ar_sa

# #30000
source: Content
ar_sa: المحتوى

# #30001
source: Movies Category Mode
ar_sa: طريقة عرض فئات الأفلام

# #30002
source: Shows Category Mode
ar_sa: طريقة عرض فئات المسلسلات

# #30003
source: Hide Clips
ar_sa: إخفاء الكليبات

# #30004
source: Hide Premium Content
ar_sa: إخفاء المحتوى الخاص بالمشتركين

# #30005
source: Mode Kids
ar_sa: وضع الاطفال

# #30006
source: Account
ar_sa: إعدادات الحساب

# #30007
source: Email
ar_sa: البريد الإلكتروني

# #30008
source: Password
ar_sa: إعدادات متقدمة

# #30011
source: Clear Cache
ar_sa: مسح ذاكرة التخزين المؤقت

# #30012
source: Custom Library Folder
ar_sa: مجلد مكتبة خاص

# #30009
source: Genre
ar_sa: فئة

# #30010
source: Dialect
ar_sa: لهجة

# #30101
source: Live TV
ar_sa: المباشر

# #30102
source: TV Shows
ar_sa: المسلسلات

# #30103
source: TV Programs
ar_sa: البرامج

# #30104
source: Movies
ar_sa: الأفلام

# #30105
source: My List
ar_sa: قائمتي

# #30106
source: Season
ar_sa: الموسم

# #30107
source: Clips
ar_sa: كليبات

# #30201
source: Wrong Code
ar_sa: كود خاطئ

# #30202
source: This Section is empty
ar_sa: هذا القسم خالي

# #30203
source: Cache Cleared Successfully
ar_sa: مسحت ذاكرة التخزين المؤقت بنجاح

# #30204
source: Successfully Added to your List
ar_sa: اضيف الى قائمتك بنجاح

# #30205
source: Somthing Went Wrong, Please retry
ar_sa: حصل خطأ الرجاء المحاولة مرة أخرى

# #30206
source: Login Failed
ar_sa: فشل عملية الدخول

# #30207
source: Premium Video
ar_sa: خاص بالمشتركين

# #30208
source: Info
ar_sa: إعلام

# #30209
source: Error
ar_sa: خطأ

# #30210
source: Successfully Added to Library
ar_sa: اضيف الى المكتبة بنجاح

# #30211
source: Add To Library
ar_sa: اضف الى المكتبة

# #30212
source: Add To My List
ar_sa: اضف الى قائمتي

# #30301
source: Kids
ar_sa: أطفال

# #30302
source: Visitor
ar_sa: زائر

# #30308
source: Premium
ar_sa: للمشتركين

# #30309
source: Trailer
ar_sa: عرض مختصر
